tests/Mock/PaymentInquiryResponseSuccess.txt

HTTP/1.1 200 Created
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=iparatest.com
SERVER_INFO: iparatest.com
CORRELATION-ID: 2a1b9202663bc
Content-Language: *
Date: Fri, 04 Jul 2014 14:09:00 GMT
Content-Type: application/json
Content-Length: 393

{"status": "success", "payment_amount": "99.99", "payment_total": "50.99", "currency": "EUR", "merchant_oid": "transactionId", "returns": [{"is_test": 1, "merchant_oid": "transactionId", "return_amount": "9.99"}]}